{
  "commands": {
    "prefix": [
      ["utility", "createembed"]
    ],
    "slash": [
      ["utility", "createembed"]
    ]
  },
  "description": [
    {
      "type": "heading",
      "text": "What are custom embeds?"
    },
    "Discord embeds are a special type of message that allows you to present data with special formatting and structure.\nCustom embeds are a feature of Wynem that allow you to create your own embeds. This may be part of another command, or simply making one with the <code class=\"command prefix\">e!createembed</code><code class=\"command slash\">/utility createembed</code> command.",
    {
      "type": "embed",
      "data": {
        "author": ["This is the Author", "/assets/images/logo/logo.webp"],
        "title": "This is the Title with a URL",
        "url": "/",
        "description": "This is the Description",
        "fields": [
          ["This is a Field Name", "This is a Field Value"],
          ["This is an Inline Field", "This is an Inline Field"],
          ["This is another Inline Field", "This is another Inline Field", true]
        ],
        "image": "/assets/images/logo/logo.webp",
        "thumbnail": "/assets/images/logo/logo.webp",
        "footer": ["This is the Footer", "/assets/images/logo/logo.webp"],
        "buttons": [{
          "label": "This is a button",
          "url": "/"
        }]
      }
    },
    {
      "type": "heading",
      "text": "How to use custom embeds"
    },
    "Throughout this guide, there will be references to different sections of embeds. If you do not know what section is being mentioned, you can refer to the image above.\n\nTo start creating a custom embed, first run the <code class=\"command prefix\">e!createembed</code><code class=\"command slash\">/utility createembed</code> command, and then click the button to start.\nIf the custom embed is being created by another command, you can ignore this step.",
    {
      "type": "embed",
      "data": {
        "description": "Press the button to start creating a custom embed",
        "buttons": [{
          "label": "Create embed",
          "emoji": "pencil"
        }]
      }
    },
    "The first modal you will see is for the main content of the embed.\nIf you do not wish to include any of these, just click submit while leaving all fields blank.",
    {
    "type": "tablelist",
      "rows": [
        ["Title", "The large text appears near the top."],
        ["URL", "If you have a title, you can turn it into a clickable link with this URL."],
        ["Description", "The main content of an embed. Supports up to 4000 characters and appears beneath the title."],
        ["Colour", "The colour of the bar up the side of the embed."]
      ]
    },
    {
      "type": "modal",
      "data": {
        "title": "Embed Builder",
        "rows": [
          ["title", "The title"],
          ["url", "Turns the title into a clickable link (requires title)"],
          ["description", "Appears underneath the title", false, 4000],
          ["colour", "Changes the colour of the bar up the side"]
        ]
      }
    },
    "After each modal, you will be given the choice to add more content, skip past the suggested content types, or finish the embed.\nThe rest of this guide will assume you always choose the first button.",
    {
      "type": "embed",
      "data": {
        "description": "Press a button to continue creating the custom embed",
        "buttons": [
          {
            "label": "Add author and footer",
            "emoji": "pencil"
          },
          {
            "label": "Skip",
            "emoji": "arrow_right"
          },
          {
            "label": "Finish",
            "emoji": "flag"
          }
        ]
      }
    },
    "The next modal you see allows you to add the author and footer to the embed.",
    {
      "type": "tablelist",
      "rows": [
        ["Author", "A row of small text that appears above the title."],
        ["Author Image URL", "A small image that appears to the left of the author."],
        ["Author URL", "This URL turns the author text in to a clickable link."],
        ["Footer", "The small text at the bottom of the embed. Supports multiple lines."],
        ["Footer Image URL", "A small image that appears to the left of the footer."]
      ]
    },
    {
      "type": "modal",
      "data": {
        "title": "Embed Builder",
        "rows": [
          ["author", "The small text at the top"],
          ["author image url", "An image to display next to the author (requires author)"],
          ["author url", "Turns the author into a clickable link (requires author)"],
          ["footer", "The small text at the bottom", false, 1024],
          ["footer image url", "An image to display next to the footer (requires footer)"]
        ]
      }
    },
    "The third modal is for adding both the main and thumbnail image to the embed.",
    {
      "type": "tablelist",
      "rows": [
        ["Image URL", "The URL for main image, which is the large image in the middle of the embed."],
        ["Thumbnail URL", "The URL for the small image in the top right corner of the embed."]
      ]
    },
    {
      "type": "modal",
      "data": {
        "title": "Embed Builder",
        "rows": [
          ["image url", "A large image in the middle"],
          ["thumbnail url", "A small image on the top right"]
        ]
      }
    },
    "Next you will have the option to add up to 25 fields to your custom embed.\nFields are small sections in the middle of the embed.\nSkipping a single field will skip all remaining fields.",
    {
      "type": "tablelist",
      "rows": [
        ["Field Name", "The name for the field."],
        ["Field Value", "The main text of the field. Appears beneath the title."],
        ["Inline", "Fields can be set to be inline, which is where they are allowed to be on the same row as another field. Up to three fields can appear on a single row.\nThis input is a simple yes or no."]
      ]
    },
    {
      "type": "modal",
      "data": {
        "title": "Embed Builder",
        "rows": [
          ["field name", "The name of the field", true],
          ["field value", "The value of the field", true],
          ["would you like the field to be inline?", false, 1024]
        ]
      }
    },
    "Finally, you will be able to add up to 25 buttons to your custom embed.\nButtons are special links that appear beneath the embed.\n\nThere are 5 rows of buttons, which support up to 5 buttons each.\nYou must have at least 1 button on a row to have another row.\nSkipping the first button in a row will skip all remaining buttons, whereas skipping any other button will skip the rest of the current row.",
    {
      "type": "tablelist",
      "rows": [
        ["Button Label", "The text that is displayed on the button."],
        ["Button URL", "The URL to go to when you click on the button."]
      ]
    },
    {
      "type": "modal",
      "data": {
        "title": "Embed Builder",
        "rows": [
          ["button label", "The text on the button", true],
          ["button url", "The URL to go to when clicking the button", true]
        ]
      }
    },
    "Some commands that use custom embeds do not support buttons.\n\n\nCongratulations, you are finished. You have now created a custom embed!"
  ]
}